app/controllers/clients_controller.rb

  def index
    if params[:client] && client = Client.find_by_name(params[:client][:name])
---
SELECT * FROM "clients" WHERE ("clients"."name" = 'Eduardo Gomes Casanova') LIMIT 1

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "updated_at", "cpf", "simple_registration", "profession", "created_at") VALUES('Paulo Tiago Gomes Casanova', '2010-06-02 18:35:37', '510.11.260-11', NULL, 'Análista de sistemas', '2010-06-02 18:35:37')

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "clients" SET "name" = 'Paulo Tiago G. Casanova', "updated_at" = '2010-06-02 18:46:20' WHERE "id" = 1